#+TITLE: Travaux Dirigés Noyaux & Particules -- Master 1
#+AUTHOR: Xavier Garrido
#+EMAIL:  xavier.garrido@u-psud.fr
#+OPTIONS: ^:{} toc:2 author:t email:t split:html
#+LATEX_CLASS: teaching-class

** Section efficace et rayon d'interaction
#+BEGIN_QUESTION
On donne les masses nucléaires suivantes, en MeV :

#+BEGIN_CENTER
$m_nc^2$ = 939.6; $m_{^{9}\text{Li}}c^2$ = 8406.9

$m_{^{10}\text{Li}}c^2$ = 9347.3; $m_{^{11}\text{Li}}c^2$ = 10285.9
#+END_CENTER
1) On cherche à estimer le rayon du noyau de\nbsp^{11}Li. Pour cela, on effectue
   tout d'abord des mesures de section efficace totale d'interaction.

   1) On bombarde une cible de\nbsp^{9}Be de 50 mg/cm^{2} d'épaisseur avec un
      faisceau de\nbsp^{11}Li, dont le flux incident vaut 10^{4}
      particules/s. En 10 minutes, on détecte dans tout l'espace 10^{5}
      réactions. Calculer la section efficace de la réaction\nbsp^{11}Li
      +\nbsp^{9}Be.

   2) Il a été montré que le rayon d'interaction nucléaire pouvait être estimé
      de façon très simple par la mesure de la section efficace totale dans les
      collisions d'ions lourds de haute énergie. Dans ce modèle simple, le rayon
      d'interaction est défini par :
      #+BEGIN_SRC latex
        \begin{align*}
          \sigma_\text{tot} = \pi(R_\text{proj.}+ R_\text{cible})^2
        \end{align*}
      #+END_SRC
      sachant que $R_\text{proj.}$ et $R_\text{cible}$ sont respectivement les
      rayons d'interaction du projectile et de la cible.

      En supposant que le rayon d'interaction du\nbsp^{9}Be peut être approximé
      par $R$(^{9}Be)=$r_0A^{1/3}$, déduire de ce modèle le rayon d'interaction
      du\nbsp^{11}Li et comparer le résultat à la valeur
      $R$(^{11}Li)=$r_0A^{1/3}$ donnée par le modèle de la goutte liquide.

   3) On refait la même expérience avec un faisceau de\nbsp^{9}Li de même
      intensité et on mesure 20000 réactions en 10 minutes. Déduire le rayon
      d'interaction du\nbsp^{9}Li.
#+END_QUESTION
1) \nbsp^{11}Li\to\nbsp^{9}Be
   1) Le nombre de réactions $n$ par unité de temps s'écrit
      #+BEGIN_SRC latex
        \begin{align*}
          n&=\phi\times\rho_e\times\frac{\mathcal{N}}{A_\text{cible}}\times\sigma
        \end{align*}
      #+END_SRC
      d'où
      #+BEGIN_SRC latex
        \begin{align*}
          \sigma&=\frac{N}{\phi}\times\frac{A_\text{cible}}{\mathcal{N}\rho_e}\\
          &=\frac{10^5/600\times9}{10^4\times6\,10^{23}\times50\,10^{-3}}\\
          \sigma(^{11}\text{Li}+^{9}\text{Be})&\simeq\unit[5\,10^{-24}]{cm}^2=\unit[5]{barn}
        \end{align*}
      #+END_SRC
   2) Soit le rayon du\nbsp^{9}Be
      #+BEGIN_SRC latex
        \begin{align*}
          R(^{9}\text{Be})=r_0\times A^{1/3}=\unit[1.25]{fm}\times9^{1/3}=\unit[2.6]{fm}
        \end{align*}
      #+END_SRC
      La section efficace devient
      #+BEGIN_SRC latex
        \begin{align*}
          \sigma(^{11}\text{Li}+^{9}\text{Be})&=\pi\left(R(^{11}\text{Li})+R(^{9}\text{Be})\right)^2=\unit[5]{barn}=\unit[500]{fm}^2\\
          R(^{11}\text{Li})&=\sqrt{\frac{\sigma}{\pi}}-R(^{9}\text{Be})\\
          &=\sqrt{\frac{\unit[500]{fm}^2}{\pi}}-\unit[2.6]{fm}\\
          &=\unit[10]{fm}\gg1.25\times11^{1/3}=\unit[2.78]{fm}
        \end{align*}
      #+END_SRC
   3) $\sigma(^{9}\text{Li}+^{9}\text{Be})=\sigma(^{11}\text{Li}+^{9}\text{Be})/5$
      d'où
      #+BEGIN_SRC latex
        \begin{align*}
          R(^{9}\text{Li})&=\sqrt{\frac{\unit[100]{fm}^2}{\pi}}-\unit[2.6]{fm}\\
          &=\unit[3.04]{fm}\gtrsim\unit[2.6]{fm}
        \end{align*}
      #+END_SRC

#+BEGIN_QUESTION
2) [@2] On bombarde maintenant la cible de\nbsp^{9}Be avec le faisceau
   de\nbsp^{11}Li précédent, pour réaliser des réactions de cassure
   du\nbsp^{11}Li :
   #+BEGIN_SRC latex
     \begin{align}
       ^{11}\text{Li} + ^9\text{Be} &\rightarrow ^{9}\text{Li} + n + n + ^9\text{Be}\\
       ^{11}\text{Li} + ^9\text{Be} &\rightarrow ^{10}\text{Li} + n + ^9\text{Be}
     \end{align}
   #+END_SRC

   1) En utilisant les masses nucléaires données précédemment, montrer que
      #+BEGIN_SRC latex
        \begin{align*}
          ^{10}\text{Li} \rightarrow ^9\text{Li} + n
        \end{align*}
      #+END_SRC
      est une réaction spontanée. En déduire la vie moyenne du\nbsp^{10}Li.

   2) Le\nbsp^{11}Li est-il lié par interaction forte ?

   3) Expliquer pourquoi on observe la réaction (1) mais pas la réaction
      (2). Que peut-on en conclure pour le\nbsp^{10}Li ?
#+END_QUESTION
2) [@2]
   1) $^{10}\text{Li}\to^{9}\text{Li}+n$

      La chaleur de réaction $Q$ est égale à
      #+BEGIN_SRC latex
        \begin{align*}
          Q&=m_{^{10}\text{Li}}c^2-m_{^{9}\text{Li}}c^2-m_{n}c^2\\
          &=9347.3-8406.9-939.6=\unit[800]{keV}
        \end{align*}
      #+END_SRC
      justifiant une réaction spontanée. Le Lithium 10 se désintègre ainsi
      presque instantanément en Lithium 9.
   2) Si on considère la réaction de cassure du\nbsp^{11}Li en\nbsp^{10}Li +
      neutron, la chaleur de réaction est
      #+BEGIN_SRC latex
        \begin{align*}
          Q&=m_{^{11}\text{Li}}c^2-m_{^{10}\text{Li}}c^2-m_{n}c^2\\
          &=10285.9-9347.3-939.6=\unit[-1]{MeV}
        \end{align*}
      #+END_SRC
      Le noyau de\nbsp^{11}Li est donc stable et lié par intéraction forte. On
      peut modéliser ce noyau comme un c\oe ur de\nbsp^{9}Li "entouré" de 2
      neutrons. Ce système à trois corps est un noyau borroméen en référence aux
      armoiries de la famille italienne Borromée. En effet, de la même manière
      que casser un des anneaux libère les deux autres, rompre une
      liaison\nbsp^{9}Li -- neutron, brise instantanément la
      seconde :\nbsp^{11}Li\to\nbsp^{9}Li.

      #+ATTR_LATEX: :align C{0.35\textwidth}C{0.5\textwidth}
      | [[./figures/borromean_rings.pdf]]  | [[./figures/borromean_nucleus.pdf]] |

   3) La seconde réaction n'est pas observable/mesurable du fait que\nbsp^{10}Li
      devient instantanément un noyau\nbsp^{9}Li. Seule la première réaction est
      observable et donc seul le rayon du\nbsp^{11}Li est mesurable.

#+BEGIN_QUESTION
3) [@3] Les rayons d'interaction ($R_\text{proj.}$) pour d'autres isotopes de
   Lithium :\nbsp^{6}Li,\nbsp^{7}Li,\nbsp^{8}Li, sont respectivement 2.14, 2.25
   et 2.38 fm. Porter sur un graphique $R=f(A)$ les rayons d'interaction de tous
   les isotopes de Li entre $A=6$ et $A=11$. Comparer avec les prédictions
   données par le modèle de la goutte liquide. Discuter ce résultat.
#+END_QUESTION
3) [@3] Comparaison $R_\text{int.}$ et modèle de la goutte liquide $R_\text{gl}$

   #+TBLNAME: radius
   |-----+--------------------+----------------------+--------|
   | $A$ | $R_\text{gl}$ [fm] | $R_\text{int.}$ [fm] |    [%] |
   |-----+--------------------+----------------------+--------|
   |   6 |               2.27 |                 2.14 |    5.7 |
   |   7 |               2.39 |                 2.25 |    5.9 |
   |   8 |                2.5 |                 2.38 |    4.8 |
   |   9 |                2.6 |                 3.04 |  -16.9 |
   |  10 |               2.69 |                  $-$ |    $-$ |
   |  11 |               2.78 |                   10 | -259.7 |
   |-----+--------------------+----------------------+--------|
   #+TBLFM: $2=round(1.25*pow($1,0.333),2)::$4=round((1-$3/$2)*100,1)

   #+BEGIN_CENTER
   #+ATTR_LATEX: :width 0.7\linewidth
   [[./figures/interaction_radius.pdf]]
   #+END_CENTER

